Internet Draft                                         Lou Berger (LabN)
Updates: 3471, 3473, 3945
Category: Standards Track                             Don Fedyk (Nortel)
Expiration Date: December 29, 2007

                                                           June 29, 2007


       Generalized MPLS (GMPLS) Support For Metro Ethernet Forum
                and G.8011 User-Network Interface (UNI)


                draft-berger-ccamp-gmpls-mef-uni-00.txt

Status of this Memo

   By submitting this Internet-Draft, each author represents that any
   applicable patent or other IPR claims of which he or she is aware
   have been or will be disclosed, and any of which he or she becomes
   aware will be disclosed, in accordance with Section 6 of BCP 79.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF), its areas, and its working groups.  Note that
   other groups may also distribute working documents as Internet-
   Drafts.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   The list of current Internet-Drafts can be accessed at
   http://www.ietf.org/1id-abstracts.html

   The list of Internet-Draft Shadow Directories can be accessed at
   http://www.ietf.org/shadow.html

   This Internet-Draft will expire on December 29, 2007.

Copyright Notice

   Copyright (C) The IETF Trust (2007).

Abstract

   This document describes a method for controlling Ethernet transport
   connections via a Generalized Multi-Protocol Label Switching (GMPLS)
   based User-Network Interface (UNI). This document supports the types
   of Ethernet services that have been defined in the context of the
   Metro Ethernet Forum (MEF) and International Telecommunication Union
   (ITU).  Specifically, Ethernet private line service and Ethernet
   virtual private line service. Support for the MEF and ITU defined
   Services parameters are also covered.  This document does not define
   or limit the underlying intra-domain or Internal NNI (I-NNI)
   technology used to support the UNI.





Berger, et al                Standards Track                    [Page 1]

Internet-Draft   draft-berger-ccamp-gmpls-mef-uni-00.txt   June 29, 2007


Contents

 1      Introduction  ..............................................   3
 1.1    Overview  ..................................................   4
 1.2    Conventions used in this document  .........................   6
 2      Common Signaling Support  ..................................   6
 2.1    UNI Addressing  ............................................   6
 2.2    Ethernet Endpoint (UNI) Identification  ....................   6
 2.2.1  Endpoint ID TLV  ...........................................   7
 2.2.2  Address Resolution  ........................................   8
 2.2.3  Notify Message Format  .....................................   9
 2.3    Connection Identification  .................................   9
 2.3.1  Procedures  ................................................  10
 2.4    Traffic Parameters  ........................................  10
 2.5    Bundling and VLAN Identification  ..........................  11
 3      EPL Service  ...............................................  11
 3.1    Data Channel Switching   ...................................  11
 3.2    EPL Service Parameters  ....................................  12
 4      EVPL Service  ..............................................  12
 4.1    Generalized Channel_Set LABEL_REQUEST Object  ..............  13
 4.2    Generalized Channel_Set LABEL Object  ......................  13
 4.2.1  EVPL Generalized Label Format  .............................  16
 4.3    Other Label related Objects  ...............................  16
 4.4    Egress VLAN ID Control and VLAN ID preservation  ...........  16
 4.5    Single Call - Single LSP  ..................................  17
 4.6    Single Call - Multiple LSPs  ...............................  17
 5      IANA Considerations  .......................................  17
 5.1    Endpoint ID Attributes TLV  ................................  17
 5.2    Error Value: Routing Problem/Unknown Endpoint  .............  18
 5.3    Data Channel Switching Type  ...............................  18
 5.4    8B/10B LSP Encoding  .......................................  18
 5.5    Generalized Channel_Set LABEL_REQUEST Object  ..............  19
 5.6    Generalized Channel_Set LABEL Object  ......................  19
 6      Security Considerations  ...................................  20
 7      References  ................................................  20
 7.1    Normative References  ......................................  20
 7.2    Informative References  ....................................  21
 8      Acknowledgments  ...........................................  22
 9      Contributor's Addresses  ...................................  22
10      Full Copyright Statement  ..................................  23
11      Intellectual Property  .....................................  23





Berger, et al                Standards Track                    [Page 2]

Internet-Draft   draft-berger-ccamp-gmpls-mef-uni-00.txt   June 29, 2007


Open issues:

There are several open issues in this document that will be resolved in
subsequent versions.  The issues include:

1. Should a more generic name be used for the new "8B/10B" LSP
   Encoding Type.

2. This document assumes that [MEF-TRAFFIC] supports signaling of
   desired L2 control protocol processing, but this is not yet
   included in [MEF-TRAFFIC].

3. This document should be divided into two documents: one that
   defines generic GMPLS support for Ethernet Services and the
   new DCSC Switching Type, and one that covers UNI specific
   topics.


1. Introduction

   [MEF6] and [G.8011] provide a parallel framework for defining
   network-oriented characteristics of Ethernet services in transport
   networks. The framework discusses general Ethernet connection
   characteristics, Ethernet User-Network Interfaces (UNIs) and Ethernet
   Network-Network Interfaces (NNIs). Within this framework, [G.8011.1]
   defines the Ethernet Private Line (EPL) service and [G.8011.2]
   defines the Ethernet Virtual Private Line (EVPL) service. [MEF6]
   covers both service types.  [MEF10.1] defines service parameters and
   [MEF11] provides UNI requirements and framework.

   This document provides a method for GMPLS based control of the
   transport services defined in the above documents at the UNI network
   reference points.  This document does not define or limit the
   underlying intra-domain or Internal NNI (I-NNI) technology used to
   support the UNI.  This document makes use of the traffic parameters
   defined in [MEF-TRAFFIC]. The document is intended to be consistent
   with [GMPLS-PBBTE] and [GELS-FRAMEWORK].

   The scope of this document covers Ethernet UNI applications, and it
   is intended to be consistent with the GMPLS overlay model presented
   in [RFC4208] and aligned with GMPLS Core Network signaling.  The
   scope and reference model used in this document are represented in
   Figure 1, which is based on Figure 1 of [RFC4208].

   Figure 1 shows two core networks, each containing two core-nodes.
   The core-nodes are labeled 'CN'.  Connected to each CN is an edge-
   node.  The edge-nodes are labeled 'EN'.  Each EN supports Ethernet
   Networks and use Ethernet services provided by the core-nodes via a



Berger, et al                Standards Track                    [Page 3]

Internet-Draft   draft-berger-ccamp-gmpls-mef-uni-00.txt   June 29, 2007


   UNI.  Two services are represented, one EPL and EVPL type service.
   Signaling within the core network is out of scope of this document
   and may include any number of technologies that support the overlay
   UNI services.

        Ethernet                                          Ethernet
        Network   UNI +----------+    +-----------+ UNI   Network
      +---------+     |          |    |           |     +---------+
      |  +----+ |     |  +-----+ |    |  +-----+  |     | +----+  |
   ------+    | | EPL |  |     | |    |  |     |  | EPL | |    +------
   ------+ EN +-+-----+--+ CN  +---------+  CN +--+-----+-+ EN +------
      |  |    | |  +--+--|     +---+  |  |     +--+-----+-+    |  |
      |  +----+ |  |  |  +--+--+ | |  |  +--+--+  |     | +----+  |
      |         |  |  |     |    | |  |     |     |     |         |
      +---------+  |  |     |    | |  |     |     |     +---------+
                   |  |     |    | |  |     |     |
      +---------+  |  |     |    | |  |     |     |     +---------+
      |         |  |  |  +--+--+ | |  |  +--+--+  |     |         |
      |  +----+ |  |  |  |     | | +-----+     |  |     | +----+  |
   ------+    +-+--+  |  | CN  +---------+ CN  |  |     | |    +------
   ------+ EN +-+-----+--+     | |    |  |     +--+-----+-+ EN +------
      |  |    | |EVPL |  +-----+ |    |  +-----+  |EVPL | |    |  |
      |  +----+ |     |          |    |           |     | +----+  |
      |         |     +----------+    |-----------+     |         |
      +---------+            Core Network(s)            +---------+
        Ethernet                                          Ethernet
        Network <---------------------------------------> Network
                          Scope of this Document

                        Legend:   EN  -  Edge Node
                                  CN  -  Core Node

                  Figure 1: Ethernet UNI Reference Model


1.1. Overview

   This document uses a largely common approach to supporting the
   Ethernet services defined in [MEF6], [G.8011.1] and [G.8011.2].  The
   approach builds on standard GMPLS mechanisms to deliver the required
   control capabilities. This document reuses the GMPLS mechanisms
   specified in [RFC3473], [RFC4208], and [GMPLS-CALLS].  The document
   also expands expands the set of existing signaling parameters in a
   fashion consistent with existing GMPLS signaling.

   Two types of connectivity between Ethernet endpoints are defined in
   [MEF6] and [G.8011]: point-to-point (P2P) and multipoint-to-
   multipoint (MP2MP). [MEF6] uses the term Ethernet Line (E-line) to



Berger, et al                Standards Track                    [Page 4]

Internet-Draft   draft-berger-ccamp-gmpls-mef-uni-00.txt   June 29, 2007


   refer to point-to-point virtual connections, and Ethernet LAN (E-LAN)
   to refer to multipoint-to-multipoint virtual connections.  [G.8011]
   also identifies point-to-multipoint (P2MP) as an area for "further
   study."  Within the context of GMPLS, support is defined for point-
   to-point unidirectional and bidirectional TE Label Switched Paths
   (LSPs), see [GMPLS-PBBTE] and [RFC3473], and unidirectional point-to-
   multipoint TE LSPs, see [GMPLS-PBBTE] and [RFC4875].

   Support for P2P and MP2MP service is required by [G.8011] and
   [MEF11].  Note that while [MEF11] requires MP2MP, [G.8011.1] and
   [G.8011.2] only require P2P.  There is a clear correspondence between
   E-Line/P2P service and GMPLS P2P TE LSPs, and support for such
   services are included in the scope of this document.  There is no
   such clear correspondence between E-LAN/MP2MP service and GMPLS TE
   LSPs.  Although it is possible to emulate the service using multiple
   P2P or P2MP TE LSPs.  The definition of support for MP2MP service is
   left for future study and is not addressed in this document.

   [MEF11] defines multiple types of control for UNI Ethernet services.
   In MEF UNI Type 1, services are configured manually.  In MEF UNI Type
   2, services may be configured manually or via a link management
   interface.  In MEF UNI Type 3, services may be established and
   managed via a signaling interface.  From the MEF perspective, this
   document is aimed at supporting the MEF UNI Type 3 mode of operation.

   [G.8011.1], [G.8011.2] and [MEF11] together with [MEF10.1] define a
   set of service attributes that are associated with each Ethernet
   connection at a UNI.  Some of these attributes are based on the
   provisioning of the local physical connection and are not modifiable
   or selectable per connection.  Other attributes are specific to a
   particular connection, or must be consistent across both the local
   and remote UNIs.  The approach taken in this document is to exclude
   the static class of attributes from signaling.  Such attributes also
   will not be explicitly discussed in this document.  The other class
   of attributes are communicated via signaling and will be reviewed in
   the sections below.  The major attributes that will be supported in
   signaling include:
      - UNI endpoint identifiers
      - Connection identifiers
      - Traffic parameters (see [MEF-TRAFFIC])
      - Bundling / VLAN IDs map (EVPL only)
      - VLAN ID Preservation (EVPL only)

   Common procedures used to signal Ethernet connections are described
   in Section 2 of this document.  Procedures related to EPL services
   are described in Section 3. Procedures related to EVPL services are
   described in Section 4.




Berger, et al                Standards Track                    [Page 5]

Internet-Draft   draft-berger-ccamp-gmpls-mef-uni-00.txt   June 29, 2007


1.2. Conventions used in this document

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this
   document are to be interpreted as described in [RFC2119].


2. Common Signaling Support

   This section describes the common mechanisms for supporting UNI
   signaled control of Ethernet connections as defined in [MEF11],
   [G.8011.1] and [G.8011.2].

   Except as specifically modified in this document, the procedures
   related to the processing of RSVP objects is not modified by this
   document.  The relevant procedures in existing documents, such as
   [RFC3473] and [RFC4208], MUST be followed in all cases not explicitly
   described in this document.


2.1. UNI Addressing

   Ethernet connections controlled via the mechanisms defined in this
   document MUST use the addressing and other procedures defined in
   [RFC4208].  Of note, this includes the use of the egress edge-node's
   IP address in the end-point address field in the SESSION object.  See
   [OIF-MEF-UNI] for an alternate approach.

   One issue that presents itself with the addressing approach taken in
   [RFC4208] is that an ingress edge-node may not receive the egress
   edge-node's IP address as part of the management, or other, request
   that results in the initiation of a new Ethernet connection.  This
   case is covered as described in Section 7.2 of [GMPLS-CALLS] and as
   modified below in Section 2.2.2.


2.2. Ethernet Endpoint (UNI) Identification

   Ethernet endpoint (UNI) identifiers, as they are defined in [G.8011]
   and [MEF10.1], differ significantly from the identifiers used by
   GMPLS.  Specifically, the Ethernet endpoint (UNI) identifiers are
   character based as apposed to the GMPLS norm of being IP address
   based.

   The approach taken by this document to address this disparity
   leverages the solution used for connection identification, see next
   section and [GMPLS-CALLS], and an LSP attributes object, see
   [RFC4420].  The solution makes use of the [GMPLS-CALLS] short call



Berger, et al                Standards Track                    [Page 6]

Internet-Draft   draft-berger-ccamp-gmpls-mef-uni-00.txt   June 29, 2007


   ID, and supports the Ethernet endpoint identifier much like [GMPLS-
   CALLS] supports the long call ID.  That is, the SENDER_TEMPLATE and
   SESSION objects carry IP addresses and a short call ID, and both long
   identifiers are carried in attributes objects.  As with the long call
   ID, the Ethernet endpoint identifier is typically only relevant at
   the ingress and egress nodes. (See Section 2.2.2 for the exception
   case.)

   As defined below, the Ethernet endpoint identifier is carried in the
   LSP_ATTRIBUTES object in a new TLV.  The new TLV is referred to as
   the Endpoint ID TLV.  The processing of the Endpoint ID TLV parallels
   the processing of the long call ID in [GMPLS-CALLS].  This processing
   requires a change to Notify message format to allow the inclusion of
   the LSP_ATTRIBUTES object.


2.2.1. Endpoint ID TLV

   The Endpoint ID TLV follows the Attributes TLV format defined in
   [RFC4420].  The Endpoint ID TLV has uses the Type value of TBA (by
   IANA).

   The TLV has the following format:

      0                   1                   2                   3
      0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |           Type (TBA)          |      Length (variable)        |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |                          Endpoint ID                          |
      |                              ...                              |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

      See [RFC4420] for a description of the Type and Length fields.
      Note that per [RFC4420], the Length field is set to the unpadded
      length of the Endpoint ID field.

      Endpoint ID

         The Endpoint ID field is a variable length field that carries
         an endpoint identifier, see [MEF10.1] and [G.8011].  This field
         MUST be null padded as defined in [RFC4420].


2.2.1.1. Procedures

   The use of the Endpoint ID TLV is required during call management.
   When a call is established or torndown per [GMPLS-CALLS], an



Berger, et al                Standards Track                    [Page 7]

Internet-Draft   draft-berger-ccamp-gmpls-mef-uni-00.txt   June 29, 2007


   LSP_ATTRIBUTES object containing an Endpoint ID TLV MUST be included
   in the Notify message along with the Long Call ID.

   Short Call ID processing, including those procedures related to call
   and connection processing, is not modified by this document and MUST
   proceed according to [GMPLS-CALLS].

   An LSP_ATTRIBUTES object containing an Endpoint ID TLV MAY be
   included in the signaling messages of an LSP (connection) associated
   with an established call. Such objects are processed according to the
   [RFC4420].


2.2.2. Address Resolution

   As mentioned above, it is possible for the ingress edge-node to not
   have the egress edge-node's IP address when initiating an Ethernet
   connection.  This presents an issue as the egress edge-node's IP
   address is carried in the SESSION object.  This case is handled
   leveraging the approach described in Section 7.2 of [GMPLS-CALLS] to
   address call ID assignment by the first core-node.

   When an edge-node initiates an Ethernet Connection and it has the
   egress Ethernet endpoint identifier, but does not have its IP
   address, the edge-node MUST create a Notify message as described in
   [GMPLS-CALLS].  The Notify message MUST include the LSP_ATTRIBUTES
   object with the Endpoint ID TLV defined in the prior section. The
   tunnel end point address field of the SESSION object in the Notify
   message MUST be set to zero (0).  The message MUST be addressed and
   sent to an address associated with the first core-node.

   When a network-node, i.e., the node providing the network side of the
   UNI receives a Notify message with the tunnel end point address field
   of the SESSION object set to zero, it MUST locate the Endpoint ID TLV
   in the LSP_ATTRIBUTES object.  If the object or TLV are not present,
   the node MUST discard the message.  In this case, a Message ID
   Acknowledgment MUST NOT be sent for the Notify message.

   When the Endpoint ID TLV is located, the node MUST map the Endpoint
   ID into the egress edge-node's IP address.  If the node is unable to
   obtain the egress address, it MUST issue an error response Notify
   messages according to Section 6.2.2. of [GMPLS-CALLS].  The Error
   code and value SHOULD be "Routing Problem/Unknown Endpoint." (To be
   assigned by IANA).

   When the node is able to obtain the egress address, the end-point
   address field of the SESSION object MUST be set to the obtained
   address, and the Notify message should be sent according to the



Berger, et al                Standards Track                    [Page 8]

Internet-Draft   draft-berger-ccamp-gmpls-mef-uni-00.txt   June 29, 2007


   standard processing defined in [GMPLS-CALLS].  The downstream nodes
   will then process the Notify according to standard processing rules.

   When the ingress receives the response Notify message, it SHOULD
   identify the call based on the Endpoint ID TLV and, when not set to
   zero on the corresponding setup Notify message, the short and long
   Call IDs. The end-point address field of the SESSION object carried
   in the response Notify message will include the egress' IP address.
   This returned address MUST be used in all subsequent messages
   associated with the Ethernet connection.

   Note that the procedure described in this section MAY be used when
   the Call IDs are generated by the initiating UNI or by the first
   core-node.


2.2.3. Notify Message Format

   The Notify message format is extended based on the format defined in
   [GMPLS-CALLS] to allow for the use of the LSP_ATTRIBUTES object as
   defined in this document.  The LSP_ATTRIBUTES object MUST be present
   when the UNI defined in this document is supported, and SHOULD follow
   the SESSION_ATTRIBUTE object.

   The format of the Notify Message is updated as follows:

      <Notify message>  ::= see [GMPLS-CALLS]

      <notify session>  ::= <SESSION> [ <ADMIN_STATUS> ]
                            [ <POLICY_DATA> ... ]
                            [ <LINK_CAPABILITY> ]
                            [ <SESSION_ATTRIBUTE> ]
                            [ <LSP_ATTRIBUTES> ]
                            [ <sender descriptor> | <flow descriptor> ]

      <sender descriptor> ::= see [RFC3473]

      <flow descriptor> ::= see [RFC3473]


2.3. Connection Identification

   UNI signaling for Ethernet connections follows the procedures defined
   in [GMPLS-CALLS]. In particular the Call related mechanisms are
   reused to support UNI endpoint identification. In the context of
   Ethernet connections, a call only exists when one or more LSPs
   (connections in [GMPLS-CALLS] terms) are present.  An LSP will always
   be established within the context of a call and, typically, only one



Berger, et al                Standards Track                    [Page 9]

Internet-Draft   draft-berger-ccamp-gmpls-mef-uni-00.txt   June 29, 2007


   LSP will be used per call.  See Section 4 for the case where more
   than one LSP may exist within a call.


2.3.1. Procedures

   Ethernet connections established according to this document MUST
   treat the Ethernet (virtual) connection identifier as the long "Call
   identifier (ID)", described in [GMPLS-CALLS].  The short Call ID MUST
   be used as described in [GMPLS-CALLS].  Use of the LINK_CAPABILITY
   object is OPTIONAL. Both network-initiated and user-initiated Calls
   MUST be supported.

   When establishing an Ethernet connection the initiator MUST first
   establish a Call per the procedures defined in [GMPLS-CALLS].  Any
   node that supports Ethernet connections MUST be able to accept and
   process call setups per [GMPLS-CALLS].

   Once a Call is established, the initiator SHOULD establish at least
   one Ethernet LSP per [GMPLS-CALLS].  LSP management, including
   removal and addition, then follows [GMPLS-CALLS].  When the last LSP
   associated with a Call is removed, the Call SHOULD be torndown per
   the procedures in [GMPLS-CALLS].

   Note, the procedures defined in Section 7.2 of [GMPLS-CALLS] provide
   support for allocation of Call IDs by the first core-node rather than
   by the initiating edge-node.


2.4. Traffic Parameters

   Several types of service attributes are carried in the traffic
   parameters defined in [MEF-TRAFFIC].  These parameters are carried in
   the FLOWSPEC and TSPEC objects as discussed in [MEF-TRAFFIC].  The
   service attributes that are carried are:
      - Bandwidth Profile
      - VLAN CoS Preservation
      - L2 Control Protocol Processing
        [Note: Modification to MEF-TRAFFIC under discussion]

   Ethernet connections established according to this document MUST use
   the traffic parameters defined in [MEF-TRAFFIC] in the FLOWSPEC and
   TSPEC objects.








Berger, et al                Standards Track                   [Page 10]

Internet-Draft   draft-berger-ccamp-gmpls-mef-uni-00.txt   June 29, 2007


2.5. Bundling and VLAN Identification

   The control of bundling and listing of VLAN identifiers is only
   supported for EVPL services.  EVPL service specific details are
   provided in Section 4.


3. EPL Service

   Both [MEF6] and [G.8011.1] define an Ethernet Private Line (EPL)
   services. In the words of [G.8011.1], EPL services carry "Ethernet
   characteristic information over dedicated bandwidth, point-to-point
   connections, provided by SDH, ATM, MPLS, PDH, ETY or OTH server layer
   networks."  [G.8011.1] defines two types of Ethernet Private Line
   (EPL) services.  Both types present a service where all data
   presented on a port is transported to the corresponding connect port.
   The types differ in that EPL type 1 service operates at the MAC frame
   layer, while EPL type 2 service operates at the line (8B/10B)
   encoding layer. [MEF6] only defines one type of EPL service, and it
   matches [G.8011.1] EPL type 1 service.  Support for both types of EPL
   services are detailed below.


3.1. Data Channel Switching

   Both types of EPL services represent a form of switching that is not
   well represented in the switching types defined in [RFC3945] and
   [RFC3471].  Current switching types support switching at the packet
   (PSC), frame (L2SC), time-slot (TDM), frequency (LSC) and fiber (FSC)
   granularity.  EPL service supports switching on a per data channel
   basis.  In EPL specific terms, EPL represents a service where all
   data received on an ingress port is switched through the network to
   an egress port.  While there are similarities between this level of
   switching and the "opaque single wavelength" case described in
   Section 3.5 of [RFC4202], EPL service support is not limited to the
   optical switching technology implied by the LSC type. Therefore, a
   new switching type is defined to support EPL service.

   The new Switching Type is called Data Channel Switching Capable
   (DCSC). DCSC interfaces are able to support switching of the whole
   digital channel presented on single channel interfaces.  Interfaces
   that inherently support multiple channels, e.g., WDM and channelized
   TDM interfaces, are specifically excluded from this type. Any
   interface that can be represented as a single digital channel are
   included.  Examples include concatenated TDM and 8B/10B encoded
   interfaces.  Framed interfaces may also be included when they support
   switching on an interface granularity.




Berger, et al                Standards Track                   [Page 11]

Internet-Draft   draft-berger-ccamp-gmpls-mef-uni-00.txt   June 29, 2007


   DCSC is represented in signaling, see [RFC3471], using the value TBA
   (by IANA).

   Port labels, as defined in [RFC3471], SHOULD be used on interfaces
   where the LSP is signaled using the DCSC Switching Type.


3.2. EPL Service Parameters

   GMPLS support for the EPL service types only differ in the LSP
   Encoding Type used. The LSP Encoding Type used for each are:

      EPL Service     LSP Encoding Type
      -----------     -----------------
      Type 1/MEF      Ethernet (2) [RFC3471]
      Type 2          8B/10B*   (TBA by IANA)

      (*) Note: type name may change in a subsequent version of
          this draft.

   The other LSP parameters specific to EPL Service are:

      Parameter       Value
      --------------  -----
      Switching Type  DCSC     (See Section 3.1)
      G-PID           Ethernet (33) [RFC3471]

   The parameters defined in this section MUST be used when establishing
   and controlling EPL service type Ethernet connections.  The
   procedures defined in Section 2 and the other procedures defined in
   [RFC3473] for the establishment and management of bidirectional LSPs
   MUST be followed when establishing and controlling EPL service type
   Ethernet connections.


4. EVPL Service

   EVPL service is defined within the context of both [G.8011.2] and
   [MEF6]. An EVPL allows for multiple Ethernet connections per UNI,
   each of which supports a specific set of VLAN IDs. The UNI service
   attributes identify different forms of EVPL services, e.g., bundled
   or unbundled.  Independent of the different forms, all EVPL Ethernet
   connections are signaled using the same mechanisms to communicate the
   one or more VLAN IDs associated with a particular Ethernet
   connection.






Berger, et al                Standards Track                   [Page 12]

Internet-Draft   draft-berger-ccamp-gmpls-mef-uni-00.txt   June 29, 2007


   As with EPL services, EVPL service related connections are signaled
   based on the procedures defined in Section 2 and the procedures
   defined in [RFC3473].  The relevant [RFC3471] parameter values that
   MUST be used for EVPL connections are:

      Parameter         Value
      --------------    -----
      Switching Type    L2SC (51)
      LSP Encoding Type Ethernet (2)
      G-PID             Ethernet (33)

   Bundled EVPL services also require the use of a service specific
   Label and related label object types.  The new EVPL related label and
   the label type objects are defined below.  Non-bundled EVPL services
   also use the new label and label type objects.  A notable implication
   of bundled EVPL services and carrying multiple VLAN IDs is that a
   Path message may grow to be larger than a single (fragmented or non-
   fragmented) IP packet.  The basic approach to solving this is to use
   a single call, see Section 2.3, and multiple LSPs.  The specifics of
   this approach are describe below in Section 4.4.


4.1. Generalized Channel_Set LABEL_REQUEST Object

   The Generalized Channel_Set LABEL_REQUEST object is used to indicate
   that the Generalized Channel_Set LABEL Object is to be used on the
   associated LSP.  The format of the Generalized Channel_Set
   LABEL_REQUEST object is the same as the Generalized LABEL_REQUEST
   object and uses of C-Type of TBA.

   The Generalized Channel_Set LABEL_REQUEST object MUST be used with
   LSPs that are being established to support an EVPL service.


4.2. Generalized Channel_Set LABEL Object

   EVPL service requires support for the communication of one or more
   VLAN IDs.  In order to enable such communication, a new LABEL object
   is defined.

   The new object is called the Generalized Channel_Set LABEL object.
   The format of the new object is based on the LABEL_SET object defined
   in [RFC3473].  It differs from the the LABEL_SET object in that the
   full set may be represented in a single object rather than the
   multiple objects required by the [RFC3473] LABEL_SET object.  The
   object MUST be used on LSPs that use the Generalized Channel_Set
   LABEL_REQUEST object.  The object is processed per [RFC3473].




Berger, et al                Standards Track                   [Page 13]

Internet-Draft   draft-berger-ccamp-gmpls-mef-uni-00.txt   June 29, 2007


   The format of the Generalized Channel_Set LABEL object is:

      0                   1                   2                   3
      0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |            Length             | Class-Num (16)|  C-Type (TBA) |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |                   Channel_Set Sub-Object 1                    |
      |                              ...                              |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      :                               :                               :
      :                               :                               :
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |                   Channel_Set Sub-Object N                    |
      |                              ...                              |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   The Channel_Set Sub-Object size is measured in bytes and MUST always
   be a multiple of 4, and at least 4, and has the following format:

      0                   1                   2                   3
      0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |    Action     |  Num Subchannels  |        Label Type         |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |                          Subchannel 1                         |
      |                               +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |       ...                     |                               :
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+                               :
      :                               :                               :
      :                               :                               :
      :                               :                               :
      :                               :                               :
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |                          Subchannel N                         |
      |                               +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |           ...                 |         Padding               |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

      Action: 8 bits

         See [RFC3471] for definition of actions.  Range actions SHOULD
         be used when possible to minimize the size of the Channel_Set
         LABEL Object.







Berger, et al                Standards Track                   [Page 14]

Internet-Draft   draft-berger-ccamp-gmpls-mef-uni-00.txt   June 29, 2007


      Number of Subchannels: 10 bits

         Indicates the number of subchannels carried in the sub-object.
         When the number of subchannels required exceeds the limit of
         the field, i.e., 1024, multiple Sub-Objects MUST be used. A
         value of zero (0) has special meaning and MUST ONLY be used in
         the UPSTREAM_LABEL object.

         A value of zero (0) is used in an UPSTREAM_LABEL object to
         indicate that the subchannel(s) used in the upstream direction
         MUST match the subchannel(s) carried in the LABEL object. When
         value of zero (0) is used, no Subchannels are included in the
         Channel_Set Sub-Object and only one Channel_Set Sub-Object may
         be present.

      Label Type: 14 bits

         See [RFC3473] for a description of this field.

      Subchannel: Variable

         See [RFC3471] for a description of this field. Note that this
         field may not be 32 bit aligned.

      Padding: Variable

         Padding is used to ensure that the length of a Channel_Set Sub-
         Object meets the multiple of 4 byte size requirement.  The
         field is only required when the Subchannel field is not 32 bit
         aligned and the number of included Subchannel fields result in
         the Sub-Object not being 32 bit aligned.

         The Padding field MUST be included when the number of bits
         represented in all the Subchannel fields included in a
         Generalized Channel_Set Sub-Object result in the Sub-Object not
         being 32 bit aligned.  When present, the Padding field MUST
         have a length that results in the Sub-Object being 32 bit
         aligned.  When present, the Padding field MUST be set to a zero
         (0) value on transmission and MUST be ignored on receipt.
         These bits SHOULD be passed through unmodified by transit
         nodes.

   For LSPs supporting EVPL service, the Label Type field MUST be set to
   indicate a generalized label (2).







Berger, et al                Standards Track                   [Page 15]

Internet-Draft   draft-berger-ccamp-gmpls-mef-uni-00.txt   June 29, 2007


4.2.1. EVPL Generalized Label Format

   LSPs used to support EVPL services MUST use the EVPL Generalized
   Label in the Subchannel field of the Generalized Channel_Set LABEL
   Object.

   The format for the Generalized Label used with EVPL services is:

      0                   1
      0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      | Rsvd  |        VLAN ID        |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

      Reserved: 4 bits

         This field is reserved. It MUST be set to zero on transmission
         and MUST be ignored on receipt. These bits SHOULD be pass
         through unmodified by transit nodes.

      VLAN ID: 12 bits

         A VLAN identifier.


4.3. Other Label related Objects

   The previous section introduces a new LABEL object.  As such the
   formats of the other label related objects are also impacted.
   Processing of these objects are not modified and remain per their
   respective specifications.  The other label related objects are
   defined in [RFC3473] and include:
      - SUGGESTED_LABEL object
      - LABEL_SET object
      - ACCEPTABLE_LABEL_SET object
      - UPSTREAM_LABEL object
      - RECOVERY_LABEL object


4.4. Egress VLAN ID Control and VLAN ID preservation

   Per [MEF6], the mapping of the single VLAN ID used at the ingress UNI
   to a different VLAN ID at the egress UNI is allowed for EVPL services
   that do not support both bundling and VLAN ID preservation.  Such a
   mapping MUST be requested and signaled based on the explicit label
   control mechanism defined in [RFC4208], and not the mechanism define
   in [RFC3473] and clarified in [RFC4003].




Berger, et al                Standards Track                   [Page 16]

Internet-Draft   draft-berger-ccamp-gmpls-mef-uni-00.txt   June 29, 2007


4.5. Single Call - Single LSP

   For simplicity in management, a single LSP SHOULD be used for each
   EVPL connection whose Path and Resv messages fit within a single
   unfragmented IP packet.  This allows the reuse of all standard LSP
   modification procedures.  Of particular note is the modification of
   the VLAN IDs associated with the Ethernet connection.  Specifically,
   when a single LSP is used to support an EVPL connection, make-before-
   break procedures, see [RFC3209], SHOULD be used to modify the
   Channel_Set LABEL object.


4.6. Single Call - Multiple LSPs

   Multiple LSPs MAY be used to support an EVPL service connection.  All
   such LSPs MUST be established within the same call and follow call
   related procedures, see Section 2.2.  The primary purpose of multiple
   LSPs is to support the case where the related objects result in a
   Path message being larger than a single unfragmented IP packet.

   When using multiple LSPs, all LSPs associated with the same call /
   EVPL connection MUST be signaled with the same LSP objects with the
   exception of the SENDER_TEMPLATE, SESSION and label related objects.
   All such LSPs SHOULD share resources.  When using multiple LSPs, VLAN
   IDs MAY be added to the EVPL connection using either a new LSP or the
   make-before-break procedures mentioned in the previous section.
   Make-before-break procedures on individual LSPs SHOULD be used to
   remove VLAN IDs.

   To change other service parameters it is necessary to resignal all
   LSPs associated with the call make-before-break procedures.



5. IANA Considerations

   IANA is requested to administer assignment of new values for
   namespaces defined in this document and reviewed in this section.


5.1. Endpoint ID Attributes TLV

   Upon approval of this document, the IANA will make the assignment in
   the "Attributes TLV Space" section of the "RSVP TE Parameters"
   registry located at http://www.iana.org/assignments/rsvp-te-
   parameters:





Berger, et al                Standards Track                   [Page 17]

Internet-Draft   draft-berger-ccamp-gmpls-mef-uni-00.txt   June 29, 2007


                      Allowed on      Allowed on
   Type  Name         LSP_ATTRIBUTES  LSP_REQUIRED_ATTRIBUTES  Reference
   ----  -----------  --------------  -----------------------  ---------
   2*    Endpoint ID  Yes             Yes                [This document]

   (*) Suggested value.


5.2. Error Value: Routing Problem/Unknown Endpoint

   Upon approval of this document, the IANA will make the assignment in
   the "Error Codes and Globally-Defined Error Value Sub-Codes"  section
   of the "RSVP PARAMETERS" registry located at
   http://www.iana.org/assignments/rsvp-parameters:

   Error Code      Meaning
     24  Routing Problem                             [RFC3209]

         This Error Code has the following globally-defined Error
         Value sub-codes:

         28* =  Unknown Endpoint                     [This document]

   (*) Suggested value.


5.3. Data Channel Switching Type

   Upon approval of this document, the IANA will make the assignment in
   the "Switching Types"  section of the "GMPLS Signaling Parameters"
   registry located at http://www.iana.org/assignments/gmpls-sig-
   parameters:

   Value   Type                                      Reference
   -----   ---------------------------               ---------
     125*   Data Channel Switching Capable (DCSC) [This document]

   (*) Suggested value.


5.4. 8B/10B LSP Encoding

   Upon approval of this document, the IANA will make the assignment in
   the "LSP Encoding Types"  section of the "GMPLS Signaling Parameters"
   registry located at http://www.iana.org/assignments/gmpls-sig-
   parameters:





Berger, et al                Standards Track                   [Page 18]

Internet-Draft   draft-berger-ccamp-gmpls-mef-uni-00.txt   June 29, 2007


   Value   Type                                 Reference
   -----   ---------------------------          ---------
      14*  8B/10B                              [This document]

   (*) Suggested value.


5.5. Generalized Channel_Set LABEL_REQUEST Object

   Upon approval of this document, the IANA will make the assignment in
   the "Class Names, Class Numbers, and Class Types" section of the
   "RSVP PARAMETERS" registry located at
   http://www.iana.org/assignments/rsvp-parameters.

   A new class type for the existing LABEL_REQUEST Object class number
   (19) with the following definition:

      Class Types or C-Types:

        5* Generalized Channel_Set                  [This document]

   (*) Suggested value.


5.6. Generalized Channel_Set LABEL Object

   Upon approval of this document, the IANA will make the assignment in
   the "Class Names, Class Numbers, and Class Types" section of the
   "RSVP PARAMETERS" registry located at
   http://www.iana.org/assignments/rsvp-parameters.

   A new class type for the existing RSVP_LABEL Object class number (16)
   with the following definition:

      Class Types or C-Types:

        4* Generalized Channel_Set                  [This document]

   (*) Suggested value.












Berger, et al                Standards Track                   [Page 19]

Internet-Draft   draft-berger-ccamp-gmpls-mef-uni-00.txt   June 29, 2007


6. Security Considerations

   This document introduces new message object formats for use in GMPLS
   signaling [RFC3473].  It does not introduce any new signaling
   messages, nor change the relationship between LSRs that are adjacent
   in the control plane. As such, this document introduces no additional
   security considerations.  See [RFC3473] for relevant security
   considerations.


7. References

7.1. Normative References

   [GMPLS-CALLS] Papadimitriou, D., Farrel, A. "Generalized MPLS
                 (GMPLS) RSVP-TE Signaling Extensions",
                 draft-ietf-ccamp-gmpls-rsvp-te-call, Work in
                 progress, January 2007.

   [MEF-TRAFFIC] Papadimitriou, D., "MEF Ethernet Traffic
                 Parameters,"
                 draft-ietf-ccamp-ethernet-traffic-parameters-02.txt,
                 Work in progress, June 2007.

   [RFC2119] Bradner, S., "Key words for use in RFCs to Indicate
             Requirement Levels," RFC 2119.

   [RFC3209] Awduche, D., Berger, L., Gan, D., Li, T.,
             Srinivasan, V. and G. Swallow, "RSVP-TE: Extensions
             to RSVP for LSP Tunnels", RFC 3209, December 2001.

   [RFC3471] Berger, L., Editor, "Generalized Multi-Protocol Label
             Switching (GMPLS) Signaling Functional Description",
             RFC 3471, January 2003.

   [RFC3473] Berger, L., Editor, "Generalized Multi-Protocol Label
             Switching (GMPLS) Signaling - Resource ReserVation
             Protocol-Traffic Engineering (RSVP-TE) Extensions",
             RFC 3473, January 2003.

   [RFC3945] Mannie, E., Editor, "Generalized Multi-Protocol Label
             Switching (GMPLS) Architecture", RFC 3945, October
             2004.








Berger, et al                Standards Track                   [Page 20]

Internet-Draft   draft-berger-ccamp-gmpls-mef-uni-00.txt   June 29, 2007


   [RFC4208] Swallow, G., et al. "Generalized Multiprotocol Label
             Switching (GMPLS) User-Network Interface (UNI): Resource
             ReserVation Protocol-Traffic Engineering
             (RSVP-TE) Support for the Overlay  Model", RFC 4208,
             October 2005.

   [RFC4420] Farrel, A., et al. "Encoding of Attributes for
             Multiprotocol Label Switching (MPLS) Label Switched Path
             (LSP) Establishment Using Resource ReserVation
             Protocol-Traffic Engineering (RSVP-TE)", RFC 4420,
             February 2006.


7.2. Informative References

   [G.8011]         ITU-T G.8011/Y.1307, "Ethernet over Transport
                    Ethernet services framework", August 2004.

   [G.8011.1]       ITU-T G.G.8011.1/Y.1307.1, "Ethernet private
                    line service", August 2004.

   [G.8011.2]       ITU-T G.8011.2/Y.1307.2, "Ethernet virtual
                    private line service", September 2005.

   [GELS-FRAMEWORK] Papadimitriou, P., et al "A Framework for
                    GMPLS-controlled Ethernet Label Switching", Work
                    in progress, February 2006.

   [GMPLS-PBBTE]    Fedyk, D., et al "GMPLS control of Ethernet" ,
                    draft-fedyk-gmpls-ethernet-pbb-te-01.txt, Work in
                    progress, June 2007.

   [MEF6]           The Metro Ethernet Forum, "Ethernet Services
                    Definitions - Phase I", MEF 6, June 2004

   [MEF10.1]        The Metro Ethernet Forum, "Ethernet Services
                    Attributes Phase 2", MEF 10.1, November 2006.

   [MEF11]          The Metro Ethernet Forum , "User Network
                    Interface (UNI) Requirements and Framework",
                    MEF 11, November 2004.

   [OIF-MEF-UNI]    Optical Internetworking Forum, "Proposed
                    Implementation Guide for use of OIF UNI signaling
                    to support MEF UNI Type 3", oif2006.281.04,
                    April 2007.





Berger, et al                Standards Track                   [Page 21]

Internet-Draft   draft-berger-ccamp-gmpls-mef-uni-00.txt   June 29, 2007


   [RFC4003]        Berger, L., "GMPLS Signaling Procedure for
                    Egress Control", RFC 4003, February 2005.

   [RFC4202]        Kompella, K., Ed., and Y. Rekhter, Ed., "Routing
                    Extensions in Support of Generalized Multi-Protocol
                    Label Switching (GMPLS)", RFC 4202, October 2005.


   [RFC4875]        Aggarwal, R., Papadimitriou, P., Yasukawa, S.,
                    Eds,  "Extensions to Resource Reservation
                    Protocol - Traffic Engineering (RSVP-TE) for
                    Point-to-Multipoint TE Label Switched Paths
                    (LSPs)", RFC 4875, May 2007.


8. Acknowledgments

   The authors would like to thank Evelyne Roch and Stephen Shew for
   their valuable comments.


9. Contributor's Addresses

   Lou Berger
   LabN Consulting, L.L.C.
   Phone: +1-301-468-9228
   Email: lberger@labn.net

   Dimitri Papadimitriou
   Alcatel Lucent
   Francis Wellesplein 1,
   B-2018 Antwerpen, Belgium
   Phone: +32 3 240-8491
   Email: Dimitri.Papadimitriou@alcatel-lucent.be


   Don Fedyk
   Nortel Networks
   600 Technology Park Drive
   Billerica, MA, 01821
   Phone: +1-978-288-3041
   Email: dwfedyk@nortel.com









Berger, et al                Standards Track                   [Page 22]

Internet-Draft   draft-berger-ccamp-gmpls-mef-uni-00.txt   June 29, 2007


10. Full Copyright Statement

   Copyright (C) The IETF Trust (2007).

   This document is subject to the rights, licenses and restrictions
   contained in BCP 78, and except as set forth therein, the authors
   retain all their rights.

   This document and the information contained herein are provided on an
   "AS IS" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS
   OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY, THE IETF TRUST AND
   THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS
   OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF
   THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED
   WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.



11. Intellectual Property

   The IETF takes no position regarding the validity or scope of any
   Intellectual Property Rights or other rights that might be claimed to
   pertain to the implementation or use of the technology described in
   this document or the extent to which any license under such rights
   might or might not be available; nor does it represent that it has
   made any independent effort to identify any such rights.  Information
   on the procedures with respect to rights in RFC documents can be
   found in BCP 78 and BCP 79.

   Copies of IPR disclosures made to the IETF Secretariat and any
   assurances of licenses to be made available, or the result of an
   attempt made to obtain a general license or permission for the use of
   such proprietary rights by implementers or users of this
   specification can be obtained from the IETF on-line IPR repository at
   http://www.ietf.org/ipr.

   The IETF invites any interested party to bring to its attention any
   copyrights, patents or patent applications, or other proprietary
   rights that may cover technology that may be required to implement
   this standard.  Please address the information to the IETF at ietf-
   ipr@ietf.org.

Acknowledgement

   Funding for the RFC Editor function is provided by the IETF
   Administrative Support Activity (IASA).





Berger, et al                Standards Track                   [Page 23]

Generated on: Fri Jun 29 14:02:42 EDT 2007
